## Loading modules and packages

In [2]:
from CLV_Analysis.DB.data_generator import generate_property
from CLV_Analysis.DB.data_generator import generate_customer
from CLV_Analysis.DB.data_generator import generate_agent
from CLV_Analysis.DB.data_generator import generate_transaction
from CLV_Analysis.DB.data_generator import generate_date
from CLV_Analysis.DB.data_generator import generate_sales
import pandas as pd
import random
import os

## Declaring Constants

In [3]:
NUMBER_OF_PROPERTIES=5000
NUMBER_OF_CUSTOMERS=3000
NUMBER_OF_AGENTS=2000
NUMBER_OF_TRANSACTIONS=4000

In [4]:
# Check if 'data_csv' folder exists, if not, create it
output_directory = 'data_csv'
if not os.path.exists(output_directory):
    os.makedirs(output_directory)

## Generating Customer Data

In [9]:
customer_data = [generate_customer(customer_id) for customer_id in range(NUMBER_OF_CUSTOMERS)]

# Save customer data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'customer.csv')
pd.DataFrame(customer_data)
#.to_csv(output_file_path, index=False)

,customer_id,customer_name,customer_surname,email,phone,country,city,address,zip_code,birthday,gender
0,0,Mitchell,Carter,morenomargaret@example.net,(825)334-6442x29780,Tunisia,East Davidville,80170 Andre Turnpike,94381,2003-08-23,Other
1,1,Jacob,Miller,wkim@example.net,+1-204-398-1276x4607,Falkland Islands (Malvinas),Marktown,98715 Ballard Burgs,96391,1983-12-02,Prefer Not To Say
2,2,Albert,Mathews,karamiller@example.com,229.782.5436x298,Reunion,Hurleyport,07493 Smith Brook,06045,1975-07-20,Other
3,3,Patrick,Hammond,kimberly87@example.net,(617)267-9771,Guatemala,East Angela,7468 Jeremy Harbor,13779,1957-06-09,Prefer Not To Say
4,4,Jeremy,Peterson,rachael55@example.com,(411)859-8935x9127,Jamaica,West Melissabury,39419 Charles Way,04039,1985-03-28,Prefer Not To Say
...,...,...,...,...,...,...,...,...,...,...,...
2995,2995,Amber,Sellers,donrice@example.com,+1-372-783-0969,China,Moraleshaven,0251 Williams Motorway Apt. 522,23364,1964-06-09,Other
2996,2996,Bethany,Brown,jgonzalez@example.com,+1-727-280-0376x54164,Northern Mariana Islands,Port Adriennemouth,49607 Estes Mission,70925,1986-03-16,Male
2997,2997,Jeremy,Richardson,davidchang@example.com,334-336-2801x8227,Luxembourg,East Troy,51258 Tracey Centers,35422,1977-09-05,Prefer Not To Say
2998,2998,Gregory,Wallace,qstrong@example.org,463.857.6493x482,Sudan,New Nathanielton,78826 Amanda Radial Apt. 236,78792,1929-01-25,Prefer Not To Say
2999,2999,Pamela,Hess,wendyford@example.net,548-406-1930x5940,Sweden,Biancaland,232 Darlene Forge,65148,1974-09-25,Other

## Generating Agent Data

In [10]:
agent_data = [generate_agent(agent_id) for agent_id in range(NUMBER_OF_AGENTS)] 
# Save agent data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'agent.csv')
pd.DataFrame(agent_data)
#.to_csv(output_file_path, index=False)

,agent_id,agent_name,agent_surname,email,phone,experience_years
0,0,John,Phillips,ccook@example.com,(453)945-7755,72
1,1,Richard,Espinoza,tiffany79@example.com,328-455-6395,53
2,2,Andrew,Miller,lori05@example.org,881.786.5464x634,38
3,3,Omar,Becker,vadams@example.com,(962)531-6893x93900,77
4,4,Timothy,Tran,shawn63@example.com,936-588-7972x493,61
...,...,...,...,...,...,...
1995,1995,Kelly,Patton,stephanieparker@example.com,+1-915-330-0471x642,0
1996,1996,Tonya,Williams,barbaraalvarez@example.com,001-852-701-6755x62606,21
1997,1997,Brent,Mcgrath,eford@example.org,4082975015,41
1998,1998,Tiffany,Carroll,nicholas41@example.com,+1-349-468-6429x90163,79
1999,1999,Richard,Brewer,hesslisa@example.org,001-623-694-0093x68642,53

## Generating Property Data

In [12]:
property_data = [generate_property(property_id) for property_id in range(NUMBER_OF_PROPERTIES)]
# Save property data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'property.csv')
pd.DataFrame(property_data)
#.to_csv(output_file_path, index=False)

,property_id,property_type,country,city,street,building_number,square_footage,number_of_bedrooms,number_of_bathrooms,year_built
0,0,Studio,San Marino,Masseyfurt,Hayes Mall,40874,9389,7,1,2007
1,1,Townhouse,Anguilla,Andrewborough,Kristina Dale,8005,13632,2,9,2023
2,2,Condo,Germany,Kimland,Kristin Turnpike,459,11250,6,8,2019
3,3,Cottage,South Georgia and the South Sandwich Islands,South Samanthamouth,Logan Manors,1411,2325,2,6,2015
4,4,Loft,Syrian Arab Republic,New Richardville,Parker Well,838,9440,9,5,2009
...,...,...,...,...,...,...,...,...,...,...
4995,4995,Studio,Bouvet Island (Bouvetoya),East Richardville,Adam Meadows,44987,11262,8,5,2004
4996,4996,Condo,Slovakia (Slovak Republic),North Felicia,Lawrence Ranch,447,13064,9,4,2015
4997,4997,Apartment,Zambia,Port Kelly,Bradley Heights,558,12057,1,7,2007
4998,4998,Villa,Nigeria,Castrotown,Castaneda Burgs,147,9142,5,8,2002
4999,4999,Villa,Ethiopia,Gonzalezmouth,Keith Centers,142,11660,3,10,2020

## Generating Transaction Data

In [14]:
transaction_data = [generate_transaction(transaction_id) for transaction_id in range(NUMBER_OF_TRANSACTIONS)] 
# Save transaction data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'transactions.csv')
pd.DataFrame(transaction_data)
#.to_csv(output_file_path, index=False)

      transaction_id  transaction_amount    transaction_date  payment_method
0                  0           138595.88 2017-09-06 01:16:51  Mobile Payment
1                  1           124555.54 2014-08-26 01:33:29      Debit Card
2                  2           512348.87 2017-02-18 13:50:40            Cash
3                  3          1500714.54 2021-03-18 23:15:02      Debit Card
4                  4          1254831.77 2022-01-17 23:54:31      Debit Card
...              ...                 ...                 ...             ...
3995            3995          1478581.89 2018-03-10 12:17:18     Credit Card
3996            3996           997519.48 2012-09-06 20:00:10  Mobile Payment
3997            3997          1818847.86 2018-03-27 01:22:23            Cash
3998            3998          1475179.05 2011-10-03 22:06:37           Check
3999            3999           998374.83 2000-06-23 13:16:51     Credit Card

[4000 rows x 4 columns]

## Generating Dates Data

In [16]:
from datetime import datetime

# Define the start and end dates as strings
start_date = "2000-01-01"
end_date = "2023-12-31"

# Convert the date strings to datetime objects
start_date_obj = datetime.strptime(start_date, "%Y-%m-%d")
end_date_obj = datetime.strptime(end_date, "%Y-%m-%d")

# Calculate the difference between the two dates
number_of_days = (end_date_obj - start_date_obj).days
number_of_days

8765

In [18]:
dates_data = [generate_date(date_id) for date_id in range(number_of_days+1)] 
# Save date data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'date.csv')
pd.DataFrame(dates_data)
#.to_csv(output_file_path, index=False)

,date_id,date,month,month_name,year,quarter,day_of_month,day_of_year,day_of_week_number,day_of_week_name,week_of_year,week_of_month
0,0,2000-01-01,1,January,2000,1,1,1,6,Saturday,52,1
1,1,2000-01-02,1,January,2000,1,2,2,7,Sunday,52,1
2,2,2000-01-03,1,January,2000,1,3,3,1,Monday,1,1
3,3,2000-01-04,1,January,2000,1,4,4,2,Tuesday,1,1
4,4,2000-01-05,1,January,2000,1,5,5,3,Wednesday,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...
8761,8761,2023-12-27,12,December,2023,4,27,361,3,Wednesday,52,4
8762,8762,2023-12-28,12,December,2023,4,28,362,4,Thursday,52,4
8763,8763,2023-12-29,12,December,2023,4,29,363,5,Friday,52,5
8764,8764,2023-12-30,12,December,2023,4,30,364,6,Saturday,52,5
8765,8765,2023-12-31,12,December,2023,4,31,365,7,Sunday,52,5

## Generating Sales Data

In [20]:
sales_data = []


for transaction_id in range(1, NUMBER_OF_TRANSACTIONS + 1):
    property_id = random.randint(1, len(property_data))
    customer_id = random.randint(1, len(customer_data))
    agent_id = random.randint(1, len(agent_data))
    date_id = random.randint(1, len(dates_data))
    
    sale = generate_sales(transaction_id, property_id, customer_id, agent_id, date_id)
    sales_data.append(sale)

In [22]:
pd.DataFrame(sales_data)
# Save sales data to CSV file in the 'data_csv' folder
output_file_path = os.path.join(output_directory, 'sales.csv')
pd.DataFrame(sales_data)
#.to_csv(output_file_path, index=False)

      transaction_id  property_id  customer_id  agent_id  date_id
0                  1         1542         1754       245     1603
1                  2         4110         2671        49     2909
2                  3          347          212       395     4608
3                  4         1864         1101      1693     4928
4                  5          692          813       413     8554
...              ...          ...          ...       ...      ...
3995            3996         4491         2595      1278     5783
3996            3997         2332         2615       923     5941
3997            3998           53         2802      1434     4580
3998            3999         4940         1441      1575     5151
3999            4000         4431         1049      1968     4128

[4000 rows x 5 columns]